In [1]:
%load_ext sql
%sql sqlite:///PS1.db

'Connected: @PS1.db'

Problem Set 1 [100 points]
=======

### Deliverables:

Submit your queries (and only those) using the `submission_template.txt` file that is posted on the class website. Follow the instructions on the file! Upload the file at Canvas (under PS1).


### Instructions / Notes:

* Run the top cell above to load the database `PS1.db` (make sure the database file, `PS1.db`, is in the same directory as this IPython notebook is running in)
* Some of the problems involve _changing_ this database (e.g. deleting rows)- you can always re-download `PS1.db` or make a copy if you want to start fresh!
* You **may** create new IPython notebook cells to use for e.g. testing, debugging, exploring, etc.- this is encouraged in fact!- **just make sure that your final answer for each question is _in its own cell_ and _clearly indicated_**
* When you see `In [*]:` to the left of the cell you are executing, this means that the code / query is _running_.
    * **If the cell is hanging- i.e. running for too long: To restart the SQL connection, you must restart the entire python kernel**
    * To restart kernel using the menu bar: "Kernel >> Restart >> Clear all outputs & restart"), then re-execute the sql connection cell at top
    * You will also need to restart the connection if you want to load a different version of the database file
* Remember:
    * `%sql [SQL]` is for _single line_ SQL queries
    * `%%sql [SQL]` is for _multi line_ SQL queries
* _Have fun!_

Problem 1: Linear Algebra [25 points]
------------------------

Two random 3x3 ($N=3$) matrices have been provided in tables `A` and `B`, having the following schema:
> * `i INT`:   Row index
> * `j INT`:   Column index
> * `val INT`: Cell value

**Note: all of your answers below _must_ work for any _square_ matrix sizes, i.e. any value of $N$**.

Note how the matrices are represented- why do we choose this format?  Run the following queries to see the matrices in a nice format:

In [3]:
%sql SELECT group_concat(val, " , ") AS "A" FROM A GROUP BY i;

 * sqlite:///PS1.db
Done.

[('7 , 5 , 8',), ('10 , 7 , 7',), ('2 , 0 , 5',)]

In [4]:
%sql SELECT group_concat(val, " , ") AS "B" FROM B GROUP BY i;

 * sqlite:///PS1.db
Done.

[('9 , 6 , 10',), ('7 , 6 , 9',), ('1 , 1 , 7',)]

### Part (a): Matrix transpose [5 points]

_Transposing_ a matrix $A$ is the operation of switching its rows with its columns- written $A^T$.  For example, if we have:

$A=\begin{bmatrix}a & b & c\\ d & e & f\\ g & h & i\end{bmatrix}$

Then:

$A^T=\begin{bmatrix}a & d & g\\ b & e & h\\ c & f & i\end{bmatrix}$

Write a _single SQL query_ to get the matrix transpose $A^T$ (in the same format as $A$- output tuples should be of format `(i,j,val)` where `i` is row, `j` is column, and the output is ordered by row then column index)

Write your query here:

In [3]:
%sql SELECT A.j AS "i", A.i AS "j", A.val From A GROUP BY i,j ORDER BY i;

 * sqlite:///PS1.db
Done.

[(0, 0, 7),
 (0, 1, 10),
 (0, 2, 2),
 (1, 0, 5),
 (1, 1, 7),
 (1, 2, 0),
 (2, 0, 8),
 (2, 1, 7),
 (2, 2, 5)]

In [4]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(0, 0, 7),
 (0, 1, 10),
 (0, 2, 2),
 (1, 0, 5),
 (1, 1, 7),
 (1, 2, 0),
 (2, 0, 8),
 (2, 1, 7),
 (2, 2, 5)]

### Part (b): Dot product I [5 points]

The _dot product_ of two vectors

$a = \begin{bmatrix}a_1 & a_2 & \dots & a_n\end{bmatrix}$

and

$b = \begin{bmatrix}b_1 & b_2 & \dots & b_n\end{bmatrix}$

is

$a\cdot b = \sum_{i=1}^n a_ib_i = a_1b_1 + a_2b_2 + \dots + a_nb_n$

Write a _single SQL query_ to take the dot product of the **second column of $A$** and the **third column of $B$.**

Write your query here:

In [11]:
%sql SELECT SUM(A.val*B.val) FROM A,B WHERE A.j = 1 AND B.j = 2 AND A.i = B.i;

 * sqlite:///PS1.db
Done.

[(113,)]

In [5]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(113,)]

### Part (c): Dot product II [5 points]

Write a _single SQL query_ to take the dot product of the **second _row_ of $A$** and the **third column of $B$.**

Write your query here:

In [12]:
%sql SELECT SUM(A.val*B.val) FROM A,B WHERE A.i = 1 AND B.j = 2 AND A.j = B.i;

 * sqlite:///PS1.db
Done.

[(212,)]

In [6]:
 """
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(212,)]

### Part (d): Matrix multiplication [10 points]

The product of a matrix $A$ (having dimensions $n\times m$) and a matrix $B$ (having dimensions $m\times p$) is the matrix $C$ (of dimension $n\times p$) having cell at row $i$ and column $j$ equal to:

$C_{ij} = \sum_{k=1}^m A_{ik}B_{kj}$

In other words, to multiply two matrices, get each cell of the resulting matrix $C$, $C_{ij}$, by taking the _dot product_ of the $i$th row of $A$ and the $j$th column of $B$.

Write a single SQL query to get the matrix product of $A$ and $B$ (in the same format as $A$ and $B$).

Write your query here:

In [7]:
%sql SELECT A.i, B.j, SUM(A.val*B.val) AS "val" FROM A,B WHERE A.j = B.i GROUP BY A.i, B.j ORDER BY A.i;

 * sqlite:///PS1.db
Done.

[(0, 0, 106),
 (0, 1, 80),
 (0, 2, 171),
 (1, 0, 146),
 (1, 1, 109),
 (1, 2, 212),
 (2, 0, 23),
 (2, 1, 17),
 (2, 2, 55)]

In [7]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(0, 0, 106),
 (0, 1, 80),
 (0, 2, 171),
 (1, 0, 146),
 (1, 1, 109),
 (1, 2, 212),
 (2, 0, 23),
 (2, 1, 17),
 (2, 2, 55)]

Problem 2: The Sales Database [35 points]
----------------------------------------------

We've prepared and loaded a dataset related to sales data from a company. The dataset has the following schema:

> `Holidays (WeekDate, IsHoliday)`

> `Stores (Store, Type, Size)`

> `TemporalData(Store,WeekDate,Temperature,FuelPrice,CPI,UnemploymentRate)`

> `Sales (Store, Dept, WeekDate, WeeklySales)`

Before you start writing queries on the database, find the schema and the constraints (keys, foreign keys).

### Part (a): Sales during Holidays [5 points]

Using a single SQL query, find the stores with the largest and smallest overall sales during holiday weeks. Further requirements:
* Use the `WITH` clause before the main body of the query to compute a subquery if necessary.
* Return a relation with schema `(Store, AllSales)`.

Write your query here:

In [12]:
%%sql 
WITH tempTable AS (
    SELECT Sales.Store AS "Store", SUM(Sales.WeeklySales) AS "AllSales" 
    FROM Sales, Holidays WHERE Sales.WeekDate = Holidays.WeekDate AND Holidays.IsHoliday = "TRUE"
    GROUP BY Sales.Store 
    ORDER BY AllSales) 
SELECT tempTable.Store, ROUND(MAX(tempTable.AllSales),2) AS "AllSales" FROM tempTable
UNION 
SELECT tempTable.Store, ROUND(MIN(tempTable.AllSales),2) AS "AllSales" FROM tempTable

 * sqlite:///PS1.db
Done.

[(20, 22490350.81), (33, 2625945.19)]

In [15]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(20, 22490350.81000001), (33, 2625945.1900000004)]

### Part (b): When Holidays do not help Sales [10 points]

Using a single SQL query, compute the **number** of non-holiday weeks that had larger sales than the overall average sales during holiday weeks. Further requirements:
* Use the `WITH` clause before the main body of the query to compute a subquery if necessary.
* Return a relation with schema `(NumNonHolidays)`.

Write your query here:

In [53]:
%%sql 
WITH tempTable AS (
    SELECT Holidays.WeekDate, Holidays.IsHoliday, SUM (Sales.WeeklySales) AS "total"
    FROM Sales, Holidays WHERE Sales.WeekDate = Holidays.WeekDate
    GROUP BY Holidays.WeekDate, Holidays.IsHoliday)
SELECT COUNT(*) AS "NumNonHolidays" FROM tempTable
WHERE IsHoliday = "FALSE" AND total > (SELECT AVG(total) FROM tempTable WHERE IsHoliday = "TRUE");

 * sqlite:///PS1.db
Done.

[(8,)]

In [33]:
%%sql
WITH nonholidaysale AS (
    SELECT Holidays.WeekDate AS "date", Holidays.IsHoliday, SUM (Sales.WeeklySales) AS "total"
    FROM Sales, Holidays WHERE Sales.WeekDate = Holidays.WeekDate AND IsHoliday = "False"
    GROUP BY Holidays.WeekDate, Holidays.IsHoliday),

holidaysale AS (
    SELECT Holidays.WeekDate AS "date", Holidays.IsHoliday, SUM (Sales.WeeklySales) AS "total"
    FROM Sales, Holidays WHERE Sales.WeekDate = Holidays.WeekDate AND IsHoliday = "True"
    GROUP BY Holidays.WeekDate, Holidays.IsHoliday)

SELECT COUNT(*) AS "NumNonHolidays" FROM (SELECT nonholidaysale.date, holidaysale.date FROM nonholidaysale,holidaysale
                                         WHERE nonholidaysale.total > AVG(holidaysale.total))

 * sqlite:///PS1.db
(sqlite3.OperationalError) misuse of aggregate function AVG()
[SQL: WITH nonholidaysale AS (
    SELECT Holidays.WeekDate AS "date", Holidays.IsHoliday, SUM (Sales.WeeklySales) AS "total"
    FROM Sales, Holidays WHERE Sales.WeekDate = Holidays.WeekDate AND IsHoliday = "False"
    GROUP BY Holidays.WeekDate, Holidays.IsHoliday),

holidaysale AS (
    SELECT Holidays.WeekDate AS "date", Holidays.IsHoliday, SUM (Sales.WeeklySales) AS "total"
    FROM Sales, Holidays WHERE Sales.WeekDate = Holidays.WeekDate AND IsHoliday = "True"
    GROUP BY Holidays.WeekDate, Holidays.IsHoliday)

SELECT COUNT(*) AS "NumNonHolidays" FROM (SELECT nonholidaysale.date, holidaysale.date FROM nonholidaysale,holidaysale
                                         WHERE nonholidaysale.total > AVG(holidaysale.total))]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [19]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(8,)]

### Part (c): Total Sales [5 points]

Using a single SQL query, compute the total sales per month overall for each type of store. Further requirements:
* Return a relation with schema `(type, Month, TotalSales)`.

*Hint:* SQLite3 does not support native operations on the DATE datatype. To create a workaround, you can use the `LIKE` predicate and the string concatenation operator (||). You can also use the substring operator that SQLite3 supports (`substr`).

Write your query here:

In [64]:
%%sql 
SELECT Stores.Type AS "type", substr(Sales.WeekDate, 6, 2) AS "Month", ROUND(SUM(Sales.WeeklySales),2) AS "TotalSales"
FROM Stores, Sales WHERE Sales.Store = Stores.Store GROUP BY Stores.Type, Month

 * sqlite:///PS1.db
Done.

[('A', '01', 214176168.1),
 ('A', '02', 366507672.38),
 ('A', '03', 380774533.1),
 ('A', '04', 416180129.88),
 ('A', '05', 359086595.84),
 ('A', '06', 399448005.77),
 ('A', '07', 417243210.39),
 ('A', '08', 394863683.69),
 ('A', '09', 373118622.19),
 ('A', '10', 377131480.28),
 ('A', '11', 264721386.61),
 ('A', '12', 367763234.52),
 ('B', '01', 95446454.8),
 ('B', '02', 167671723.74),
 ('B', '03', 175136037.61),
 ('B', '04', 190880594.59),
 ('B', '05', 163455609.25),
 ('B', '06', 186362500.36),
 ('B', '07', 193743232.0),
 ('B', '08', 181504990.04),
 ('B', '09', 168953941.76),
 ('B', '10', 170604194.6),
 ('B', '11', 125545696.87),
 ('B', '12', 181395761.2),
 ('C', '01', 22975815.59),
 ('C', '02', 34548494.33),
 ('C', '03', 36875330.57),
 ('C', '04', 39799060.5),
 ('C', '05', 34583366.86),
 ('C', '06', 36819380.71),
 ('C', '07', 39014534.86),
 ('C', '08', 36721535.09),
 ('C', '09', 36688615.31),
 ('C', '10', 37049112.71),
 ('C', '11', 22748641.53),
 ('C', '12', 27679639.48)]

In [21]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(u'A', u'01', 214176168.09999868),
 (u'A', u'02', 366507672.3800041),
 (u'A', u'03', 380774533.0999994),
 (u'A', u'04', 416180129.8799989),
 (u'A', u'05', 359086595.83999956),
 (u'A', u'06', 399448005.7700002),
 (u'A', u'07', 417243210.38999707),
 (u'A', u'08', 394863683.68999743),
 (u'A', u'09', 373118622.1900005),
 (u'A', u'10', 377131480.28000176),
 (u'A', u'11', 264721386.60999998),
 (u'A', u'12', 367763234.5200006),
 (u'B', u'01', 95446454.79999965),
 (u'B', u'02', 167671723.73999923),
 (u'B', u'03', 175136037.61000007),
 (u'B', u'04', 190880594.58999932),
 (u'B', u'05', 163455609.2500001),
 (u'B', u'06', 186362500.36000022),
 (u'B', u'07', 193743231.9999991),
 (u'B', u'08', 181504990.0400001),
 (u'B', u'09', 168953941.7599988),
 (u'B', u'10', 170604194.5999999),
 (u'B', u'11', 125545696.86999977),
 (u'B', u'12', 181395761.19999966),
 (u'C', u'01', 22975815.59),
 (u'C', u'02', 34548494.330000006),
 (u'C', u'03', 36875330.56999996),
 (u'C', u'04', 39799060.49999998),
 (u'C', u'05', 34583366.86000001),
 (u'C', u'06', 36819380.709999934),
 (u'C', u'07', 39014534.860000074),
 (u'C', u'08', 36721535.09000013),
 (u'C', u'09', 36688615.31000005),
 (u'C', u'10', 37049112.70999994),
 (u'C', u'11', 22748641.530000072),
 (u'C', u'12', 27679639.47999999)]

### Part (d): Computing Correlations [15 points]

The goal of this exercise is to find out whether each one of the 4 numeric attributes in `TemporalData` is
positively or negatively correlated with sales.

For our purposes, the intuitive notion of correlation is defined using a
standard statistical quantity known as the *Pearson correlation coefficient*.
Given two numeric random variables $X$ and $Y$, it is defined as follows:

$$\rho_{X,Y} = \frac{E[XY] - E[X]E[Y]}{\sqrt{E[X^2] - E[X]^2} \sqrt{E[Y^2] - E[Y]^2}}$$

On a given sample of data with $n$ examples each for $X$ and $Y$ (label them
$x_i$ and $y_i$ respectively for $i = 1 \dots n$), it is estimated as follows:

\begin{align*}
\rho_{X,Y} = \frac{\sum_{i=1}^n (x_i - \bar{x})(y_i - \bar{y})}{\sqrt{\sum_{i=1}^n (x_i - \bar{x})^2} \sqrt{\sum_{i=1}^n (y_i - \bar{y})^2}}
\end{align*}
In the above, $\bar{x}$ and $\bar{y}$ are the sample means, i.e.,
$\bar{x} = \frac{1}{n}\sum_{i=1}^n x_i$, and $\bar{x} = \frac{1}{n}\sum_{i=1}^n y_i$.

Further requirements:
* Return a relation with schema `(AttributeName VARCHAR(20), CorrelationSign Integer)`. 
* The values of AttributeName can be hardcoded string literals, but the values
of `CorrelationSign` must be computed automatically using SQL queries over
the given database instance.
* You can use multiple SQL statements to compute the result. It might be of help to create and update your own tables.

Write your query here:

In [67]:
%%sql
DROP TABLE IF EXISTS avgs;
DROP TABLE IF EXISTS relation;
CREATE TABLE avgs AS
    SELECT AVG(Sales.WeeklySales) AS "Sales",AVG(TemporalData.Temperature) AS "Temp",
    AVG(TemporalData.FuelPrice) AS "Fuel",AVG(TemporalData.CPI) AS "CPI",
    AVG(TemporalData.UnemploymentRate) AS "Unemploy"
    FROM TemporalData, Sales WHERE TemporalData.Store = Sales.Store AND TemporalData.WeekDate = Sales.WeekDate;

CREATE TABLE relation (AttributeName VARCHAR(20), CorrelationSign Integer);

INSERT INTO relation VALUES 
("Temperature",(SELECT SUM((Sales.WeeklySales - (SELECT avgs.Sales FROM avgs))
                           *(TemporalData.Temperature - (SELECT avgs.Temp FROM avgs)))
                FROM TemporalData, Sales
                WHERE Sales.Store = TemporalData.Store AND Sales.WeekDate = TemporalData.WeekDate));

INSERT INTO relation VALUES 
("FuelPrice",(SELECT SUM((Sales.WeeklySales - (SELECT avgs.Sales FROM avgs))
                         *(TemporalData.FuelPrice - (SELECT avgs.Fuel FROM avgs)))
              FROM TemporalData, Sales
              WHERE Sales.Store = TemporalData.Store AND Sales.WeekDate = TemporalData.WeekDate));

INSERT INTO relation VALUES 
("CPI",(SELECT SUM((Sales.WeeklySales - (SELECT avgs.Sales FROM avgs))
                   *(TemporalData.CPI - (SELECT avgs.CPI FROM avgs)))
        FROM TemporalData, Sales
        WHERE Sales.Store = TemporalData.Store AND Sales.WeekDate = TemporalData.WeekDate));

INSERT INTO relation VALUES 
("UnemploymentRate",(SELECT SUM((Sales.WeeklySales - (SELECT avgs.Sales FROM avgs))
                                *(TemporalData.UnemploymentRate - (SELECT avgs.Unemploy FROM avgs)))
                     FROM TemporalData, Sales
                     WHERE Sales.Store = TemporalData.Store AND Sales.WeekDate = TemporalData.WeekDate));

UPDATE relation SET CorrelationSign = -1 WHERE CorrelationSign < 0;
UPDATE relation SET CorrelationSign = 1 WHERE CorrelationSign > 0;
                    
SELECT AttributeName,CorrelationSign FROM relation;

 * sqlite:///PS1.db
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
4 rows affected.
0 rows affected.
Done.

[('Temperature', -1), ('FuelPrice', -1), ('CPI', -1), ('UnemploymentRate', -1)]

In [27]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(u'Temperature', -1),
 (u'FuelPrice', -1),
 (u'CPI', -1),
 (u'UnemploymentRate', -1)]

Problem 3: The Traveling SQL Server Salesman Problem [40 points]
--------------------------------------------------

SQL Server salespeople are lucky as far as traveling salespeople go- they only have to sell one or two big enterprise contracts, at one or two offices in Wisconsin, in order to make their monthly quota!

Answer the following questions using the table of streets connecting company office buildings.

**Note that for convenience all streets are included _twice_, as $A \rightarrow B$ and $B \rightarrow A$.  This should make some parts of the problem easier, but remember to take it into account!**

In [30]:
%sql SELECT * FROM streets LIMIT 4;

 * sqlite:///PS1.db
Done.

[(0, 'F', 'UW-Madison', 'DooHickey Collective', 7),
 (0, 'R', 'DooHickey Collective', 'UW-Madison', 7),
 (1, 'F', 'DooHickey Collective', 'Gizmo Corp', 2),
 (1, 'R', 'Gizmo Corp', 'DooHickey Collective', 2)]

### Part (a): One-hop, two-hop, three-hop... [10 points]

Our salesperson has stopped at UW-Madison, to steal some cool new RDBMS technology from CS564-ers, and now wants to go sell it to a company _within 10 miles of UW-Madison and _passing through no more than 3 distinct streets_.  Write a single query, not using `WITH` (see later on), to find all such companies.

Your query should return the schema `(company, distance)` where distance is cumulative from UW-Madison.

Write your query here:

In [65]:
%%sql 
SELECT streets.B AS "company", streets.d as "distance" FROM streets
WHERE streets.A = "UW-Madison" AND streets.d <= 10
UNION
SELECT DISTINCT st2.B AS "company", st1.d + st2.d as "distance" FROM streets st1, streets st2 
WHERE st1.A = "UW-Madison" AND st1.d + st2.d <= 10 AND st1.B = st2.A AND st1.direction = "F" AND st2.direction = "F"
UNION    
SELECT DISTINCT st3.B AS "company", st1.d + st2.d + st3.d as "distance" FROM streets st1, streets st2, streets st3 
WHERE st1.A = "UW-Madison" AND st1.d+st2.d+st3.d <= 10 AND st1.B = st2.A AND st2.B = st3.A AND st2.direction = "F" AND st3.direction = "F";

 * sqlite:///PS1.db
Done.

[('DooHickey Collective', 7),
 ('DooHickey Corp', 9),
 ('Gadget Collective', 9),
 ('Gadget Corp', 6),
 ('Gizmo Corp', 9),
 ('Widget Industries', 10)]

In [16]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(u'DooHickey Collective', 7),
 (u'DooHickey Corp', 9),
 (u'Gadget Collective', 9),
 (u'Gadget Corp', 6),
 (u'Gizmo Corp', 9),
 (u'Widget Industries', 10)]

### Part (b): A stop at the Farm [10 points]

Now, our salesperson is out in the field, and wants to see all routes- and their distances- which will take him/her from a company $A$ to a company $B$, with the following constraints:
* The route must _pass through UW-Madison (in order to pick up new RDBMS tech to sell!)
* $A$ and $B$ must _each individually_ be _within 3 hops of UW-Madison
* $A$ and $B$ must be different companies
* _The total distance must be $<= 15$_
* Do not use `WITH`
* If you return a path $A \rightarrow B$, _also include $B \rightarrow A$ in your answer_

In order to make your answer a bit cleaner, you may split into two queries, one of which creates a `VIEW`.  A view is a virtual table based on the output set of a SQL query.  A view can be used just like a normal table- the only difference under the hood is that the DBMS re-evaluates the query used to generate it each time a view is queried by a user (thus the data is always up-to date!)

Here's a simple example of a view:

In [17]:
%%sql 
DROP VIEW IF EXISTS short_streets;
CREATE VIEW short_streets AS 
SELECT A, B, d FROM streets WHERE d < 3;
SELECT * FROM short_streets LIMIT 3;

Done.
Done.
Done.

[(u'DooHickey Collective', u'Gizmo Corp', 2),
 (u'Gizmo Corp', u'DooHickey Collective', 2),
 (u'Gizmo Corp', u'Widget Industries', 1)]

Write your query or queries here:

In [64]:
%%sql 
DROP VIEW IF EXISTS path;
CREATE VIEW path AS
    SELECT st1.A, st1.B, st1.d AS "d" FROM streets st1 
    WHERE st1.A = "UW-Madison"
    UNION
    SELECT DISTINCT st1.A, st2.B, st1.d + st2.d AS "d" FROM streets st1, streets st2
    WHERE st1.A = "UW-Madison" AND st1.B = st2.A
    UNION
    SELECT DISTINCT st1.A, st2.B, (st1.d + st2.d + st3.d) AS "d" FROM streets st1, streets st2, streets st3 
    WHERE st1.A = "UW-Madison" AND st1.B = st2.A AND st2.B = st3.A;

SELECT p1.B AS "company_1", p2.B AS "company_2", (p1.d+p2.d) AS "distance" FROM path p1, path p2
WHERE p1.B != p2.B AND distance <= 15 GROUP BY company_1,company_2,distance;

 * sqlite:///PS1.db
Done.
Done.
Done.

[('DooHickey Collective', 'Gadget Corp', 13),
 ('DooHickey Corp', 'Gadget Corp', 15),
 ('Gadget Collective', 'Gadget Corp', 15),
 ('Gadget Corp', 'DooHickey Collective', 13),
 ('Gadget Corp', 'DooHickey Corp', 15),
 ('Gadget Corp', 'Gadget Collective', 15),
 ('Gadget Corp', 'Gizmo Corp', 15),
 ('Gizmo Corp', 'Gadget Corp', 15)]

In [18]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.
Done.
Done.

[(u'DooHickey Collective', u'Gadget Corp', 13),
 (u'DooHickey Corp', u'Gadget Corp', 15),
 (u'Gadget Collective', u'Gadget Corp', 15),
 (u'Gadget Corp', u'DooHickey Collective', 13),
 (u'Gadget Corp', u'DooHickey Corp', 15),
 (u'Gadget Corp', u'Gadget Collective', 15),
 (u'Gadget Corp', u'Gizmo Corp', 15),
 (u'Gizmo Corp', u'Gadget Corp', 15)]

### Part (c): Ensuring acyclicity [10 points]

You may have noticed at this point that the network, or **_graph_**, of streets in our `streets` table seems like it might be a **tree**.

Recall that a **_tree_** is an undirected graph where each node has exactly one parent (or, is the root, and has none), but may have multiple children.  A slightly more formal definition of a tree is as follows: 

> An undirected graph $T$ is a **_tree_** if it is **connected**- meaning that there is a path between every pair of nodes- and has no **cycles** (informally, closed loops)

Suppose that we guarantee the following about the graph of companies & streets determined by the `streets` table:
* It is _connected_
* It has no cycles of length $> 3$

Write a _single SQL query_ which, if our graph is not a tree (i.e. if this isn't a [shaggy dog problem](https://en.wikipedia.org/wiki/Shaggy_dog_story)), **turns it into a tree** by deleting exactly _one_ street (*= two entries in our table!*).  Write your query here:

In [2]:
%reload_ext sql
%sql sqlite:///PS1.db

'Connected: @PS1.db'

In [3]:
%%sql 
DELETE FROM streets 
WHERE streets.id IN (SELECT st1.id FROM streets st1, streets st2, streets st3
            WHERE st1.B = st2.A AND st2.B = st3.A AND st3.B = st1.A LIMIT 1);

 * sqlite:///PS1.db
2 rows affected.

[]

In [19]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

2 rows affected.

[]

### Part (d): The longest path [10 points]

In this part, we want to find the distance of the _longest path between any two companies_.

Note that you should probably have done Part (c) first so that the graph of streets is a _tree_- this will make it much easier to work with!

If you've done the other parts above, you might be skeptical that SQL can find paths of arbitrary lengths (which is what we need to do for this problem); how can we do this?

There are some non-standard SQL functions- i.e. not universally supported by all SQL DBMSs- which are often incredibly useful.  One of these is the `WITH RECURSIVE` clause, supported by SQLite.

A `WITH` clause lets you define what is essentially a view within a clause, mainly to clean up your SQL code.  A trivial example, to illustrate `WITH`:

In [4]:
%%sql
WITH companies(name) AS (
    SELECT DISTINCT A FROM streets)
SELECT * 
FROM companies 
WHERE name LIKE '%Gizmo%';

 * sqlite:///PS1.db
Done.

[('Gizmo Corp',),
 ('GizmoWorks',),
 ('Gizmo Industries',),
 ('Gizmo Collective',),
 ('GizmoCo',)]

There is also a recursive variant, `WITH RECURSIVE`.  `WITH RECURSIVE` allows you to define a view just as above, except the table can be defined recursively.  A `WITH RECURSIVE` clause must be of the following form:

```
WITH RECURSIVE 
    R(...) AS (
        SELECT ... 
        UNION [ALL] 
        SELECT ... FROM R, ...
    )
...
```

`R` is the _recursive table_.  The `AS` clause contains two `SELECT` statements, conjoined by a `UNION` or `UNION ALL`; the first `SELECT` statement provides the initial / base case values, and the second or _recursive_ `SELECT` statement must include the recursive table in its `FROM` clause.

Basically, the recursive `SELECT` statement continues executing on the tuple _most recently inserted into `R`_, inserting output rows back into `R`, and proceeding recursively in this way, until it no longer outputs any rows, and then stops.  See the [SQLite documentation](https://www.sqlite.org/lang_with.html) for more detail.

The following example computes $5! = 5*4*3*2*1$ using `WITH RECURSIVE`:

In [21]:
%%sql
WITH RECURSIVE
    factorials(n,x) AS (
        SELECT 1, 1
        UNION
        SELECT n+1, (n+1)*x FROM factorials WHERE n < 5)
SELECT x FROM factorials WHERE n = 5;

Done.

[(120,)]

In this example:

1. First, `(1,1)` is inserted into the table `factorials` (the base case).
2. Next, this tuple is returned by the recursive select, as `(n, x)`, and we insert the result back into `factorials`: `(1+1, (1+1)*1) = (2,2)`
3. Next, we do the same with the last tuple inserted into `factorials`- `(2,2)`- and insert `(2+1, (2+1)*2) = (3,6)`
4. And again: get `(3,6)` from `factorials` and insert `(3+1, (3+1)*6) = (4,24)` back in
5. And again: `(4,24)` -> `(4+1, (4+1)*24) = (5,120)`
6. Now the last tuple inserted into `factorials` is `(5, 120)`, which fails the `WHERE n < 5` clause, and thus our recursive select returns an empty set, and our `WITH RECURSIVE` statement concludes
7. Finally, now that our `WITH RECURSIVE` clause has concluded, we move on to the `SELECT x FROM factorials WHERE n=5` clause, which gets us our answer!

#### Now, your turn!

Write a single SQL query that uses `WITH RECURSIVE` to find the furthest (by distance) pair of companies that still have a path of streets connecting them.  Your query should return `(A, B, distance)`.

Write your query here:

In [58]:
%%sql
WITH RECURSIVE maxpath(start,curr,prev,d) AS (
    SELECT streets.A, streets.B, streets.A, streets.d FROM streets
    UNION
    SELECT maxpath.start, streets.B, streets.A, maxpath.d+streets.d FROM maxpath, streets
    WHERE maxpath.curr = streets.A AND maxpath.start != streets.B AND maxpath.prev != streets.B)
SELECT start AS "A", curr AS "B", MAX(d) AS "distance" FROM maxpath;

 * sqlite:///PS1.db
Done.

[('GadgetWorks', 'ThingWorks', 63)]

In [57]:
%%sql
WITH RECURSIVE
LongestPath(a, b, prev, d) AS(
    SELECT A, B, A, d 
    FROM streets
    UNION ALL
    
    SELECT p.a, s.B, s.A, p.d + s.d
    FROM LongestPath p, streets s
    WHERE p.b = s.A AND s.B != p.a AND s.B != p.prev
)

SELECT a AS A, b AS B, MAX(d) AS distance
FROM LongestPath;

 * sqlite:///PS1.db
Done.

[('GadgetWorks', 'ThingWorks', 63)]

In [22]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(u'GadgetWorks', u'ThingWorks', 63)]

### Note on alternate output

**NOTE:** The **_distance_** of the longest path could be **49 _OR_ 63** depending on which street you deleted in Part (c)!